/**
 * UDisk_SD_Lib_CH376.h - CH376 Common instruction library
 * Copyright (c) 2016 CreatBot. All Right Reserved.
 * Developer Lyn Lee, 18 March 2016.
 */

#include "Arduino.h"

#ifndef __CH376INC_H__
#define __CH376INC_H__

#ifdef __cplusplus
extern "C" {
#endif

/* Hardware characteristics*/
#define	CH376_DAT_BLOCK_LEN	0x40			/* USB single packet, maximum length of data block, default buffer length*/


/* **********************************************************************************************************************/
/* Command code*/
/* Some commands are compatible with CH375 chips, but the possible part of the input data or output data is partially different)*/
/* aCommandOperationOrderIncludes:
A command code (for the serial port method, two synchronous codes need to be needed before the command code),
Several input data (which can be 0),
Generate interrupt notification or several output data (can be 0).
Only CMD01_WR_REQ_DATA command exception, the order includes: a command code, an output data, several input data
Command code naming rules: cmdxy_name
The X and Y of which are numbers, x indicates that the minimum number of data (byte number) is entered, and y indicates the minimum number of output data (byte number).
Some commands can be read and write with data blocks with 0 to multiple bytes. The number of bytes of the data block itself is not included in X or Y above */

#define	ERR_FDT_OVER		0xB2			/* There are too many files in the directory (folder), there is no idle directory item, the number of files in FAT12/FAT16 should be less*/
#define	ERR_FILE_CLOSE		0xB4			/* The file has been closed, if it is needed, the file should be reopened*/
#define	ERR_OPEN_DIR		0x41			/* Directory (folder) of the specified path is opened*/
#define	ERR_MISS_FILE		0x42			/* The files of the specified path are not found, it may be the file name error*/
#define	ERR_FOUND_NAME		0x43			/* Searched the matching file name, or required to open the directory (folder), but the actual results opened the file*/

/* The following file system error code is used for file system subroutines*/
#define	ERR_MISS_DIR		0xB3			/* A sub -directory (folder) that specifies the path is not found, it may be the name of the directory name*/
#define	ERR_LONG_BUF_OVER	0x48			/* Long file buffer overflow*/
#define	ERR_LONG_NAME_ERR	0x49			/* There is no corresponding long file name or a long file name error of the short file name*/
#define	ERR_NAME_EXIST		0x4A			/* The short file of the same name already exists, it is recommended to re -generate another short file name*/
#endif

/* **********************************************************************************************************************/
/* The following status code is used for disk and file status in the host file mode, var_disk_status*/
#ifndef	DEF_DISK_UNKNOWN
#define	DEF_DISK_UNKNOWN	0x00			/* Not initialized, unknown state*/
#define	DEF_DISK_DISCONN	0x01			/* The disk is not connected or has been disconnected*/
#define	DEF_DISK_CONNECT	0x02			/* The disk has been connected, but the disk has not been initialized or cannot be recognized*/
#define	DEF_DISK_MOUNTED	0x03			/* The disk has been initialized, but the file system or file system has not been analyzed.*/
#define	DEF_DISK_READY		0x10			/* The file system that has been analyzed has been analyzed and can support*/
#define	DEF_DISK_OPEN_ROOT	0x12			/* The root directory has been opened, and it must be closed after use. Pay attention to the fat12/fat16 root directory is the fixed length*/
#define	DEF_DISK_OPEN_DIR	0x13			/* Have opened the sub -directory (folder)*/
#define	DEF_DISK_OPEN_FILE	0x14			/* Already open the file*/
#endif

/* **********************************************************************************************************************/
/* Common definition of file system*/

#ifndef	DEF_SECTOR_SIZE
#define	DEF_SECTOR_SIZE		512				/* U disk or SD card default physical sector size*/
#endif

#ifndef	DEF_WILDCARD_CHAR
#define	DEF_WILDCARD_CHAR	0x2A			/* Path names of the path name '*'*/
#define	DEF_SEPAR_CHAR1		0x5C			/* The separator of the path name '\'*/
#define	DEF_SEPAR_CHAR2		0x2F			/* The separator of the path name '/'*/
#define	DEF_FILE_YEAR		2004			/* Default file date: 2004*/
#define	DEF_FILE_MONTH		1				/* Default file date: January*/
#define	DEF_FILE_DATE		1				/* Default file date: 1 day*/
#endif

#define ATTR_DIRECTORY		//By LYN (defined in usbStructs.h)
#ifndef	ATTR_DIRECTORY

/* FAT Data Area File Catalog Information*/
	typedef struct _FAT_DIR_INFO {
		uint8_t		DIR_Name[11];					/* 00h, file name, a total of 11 bytes, filling the blank in shortcomings*/
		uint8_t		DIR_Attr;						/* 0bh, file attribute, refer to the later description*/
		uint8_t		DIR_NTRes;						/* 0CH*/
		uint8_t		DIR_CrtTimeTenth;				/* 0dh, the time of the file creation, count in 0.1 seconds in unit count*/
		uint16_t	DIR_CrtTime;					/* 0eh, the time of file creation*/
		uint16_t	DIR_CrtDate;					/* 10h, the date of file creation*/
		uint16_t	DIR_LstAccDate;					/* 12h, the date of the latest access operation*/
		uint16_t	DIR_FstClusHI;					/* 14H*/
		uint16_t	DIR_WrtTime;					/* 16h, file modification time, refer to the previous macro_file_time*/
		uint16_t	DIR_WrtDate;					/* 18H, file modification date, refer to the previous macro_file_date*/
		uint16_t	DIR_FstClusLO;					/* 1AH*/
		uint32_t	DIR_FileSize;					/* 1ch, file length*/
	} FAT_DIR_INFO, *P_FAT_DIR_INFO;				/* 20H*/

/* File attribute*/
/* File attribute uINT8_T*/
/* Bit0 Bit1 Bit2 Bit3 Bit4 Bit5 Bit6 Bit7*/
/* Unseen only in hidden scrolls*/
/* Read the Tibetan Tibetan Bidding File*/
#define ATTR_READ_ONLY			0x01		/* The file is read only attributes*/
#define ATTR_HIDDEN				0x02		/* The file is the implicit attribute*/
#define ATTR_SYSTEM				0x04		/* The file is the system attribute*/
#define ATTR_VOLUME_ID			0x08		/* Label*/
#define ATTR_DIRECTORY			0x10		/* Subtraction (folder)*/
#define ATTR_ARCHIVE			0x20		/* The file is the archive attribute*/
#define ATTR_LONG_NAME			( ATTR_READ_ONLY | ATTR_HIDDEN | ATTR_SYSTEM | ATTR_VOLUME_ID )	/* Long file name attribute*/
#define ATTR_LONG_NAME_MASK		( ATTR_LONG_NAME | ATTR_DIRECTORY | ATTR_ARCHIVE )

/* File Time UINT16_T*/
/* Time = (Hour<<11) + (Minute<<5) + (Second>>1)*/
#define MAKE_FILE_TIME( h, m, s )	( (h<<11) + (m<<5) + (s>>1) )	/* Generate a specified time -time file time data*/

/* File Date UINT16_T*/
/* Date = ((Year-1980)<<9) + (Month<<5) + Day*/
#define MAKE_FILE_DATE( y, m, d )	( ((y-1980)<<9) + (m<<5) + d )	/* Generate file date data for the specified year, month, month and day*/

#define LONE_NAME_MAX_CHAR		(255*2)		/* The most character number/byte number of the long file name*/
#define LONG_NAME_PER_DIR		(13*2)		/* The number/byte number of the long file name in each file directory information structure*/

#endif

/* **********************************************************************************************************************/
/* SCSI command and data input and output structure*/

#ifndef	SPC_CMD_INQUIRY

/* SCSI command code*/
#define SPC_CMD_INQUIRY			0x12
#define SPC_CMD_READ_CAPACITY	0x25
#define SPC_CMD_READ10			0x28
#define SPC_CMD_WRITE10			0x2A
#define SPC_CMD_TEST_READY		0x00
#define SPC_CMD_REQUEST_SENSE	0x03
#define SPC_CMD_MODESENSE6		0x1A
#define SPC_CMD_MODESENSE10		0x5A
#define SPC_CMD_START_STOP		0x1B

/* Command block of Bulkonly protocol*/
	typedef struct _BULK_ONLY_CBW {
		uint32_t	CBW_Sig;
		uint32_t	CBW_Tag;
		uint8_t		CBW_DataLen0;				/* 08h, input: data transmission length, the valid value for input data is 0 to 48, and the valid value for output data is 0 to 33*/
		uint8_t		CBW_DataLen1;
		uint16_t	CBW_DataLen2;
		uint8_t		CBW_Flag;					/* 0CH, input: transmission direction and other logos, the bit 7 is 1 input data, the digit is 0, the output data or no data*/
		uint8_t		CBW_LUN;
		uint8_t		CBW_CB_Len;					/* 0eh, input: the length of the command block, the valid value is 1 to 16*/
		uint8_t		CBW_CB_Buf[16];				/* 0fh, input: command block, this buffer is up to 16 bytes*/
	} BULK_ONLY_CBW, *P_BULK_ONLY_CBW;			/* The command block of the BULKONLY protocol, enter the CBW structure*/

/* Return data of inquiry command*/
	typedef struct _INQUIRY_DATA {
		uint8_t	DeviceType;						/* 00h, device type*/
		uint8_t	RemovableMedia;					/* 01H, bit 7 is 1 instructions for mobile storage*/
		uint8_t	Versions;						/* 02H, protocol version*/
		uint8_t	DataFormatAndEtc;				/* 03h, specify the return data format*/
		uint8_t	AdditionalLength;				/* 04h, the length of the follow -up data*/
		uint8_t	Reserved1;
		uint8_t	Reserved2;
		uint8_t	MiscFlag;						/* 07h, some control signs*/
		uint8_t	VendorIdStr[8];					/* 08h, manufacturer information*/
		uint8_t	ProductIdStr[16];				/* 10h, product information*/
		uint8_t	ProductRevStr[4];				/* 20H, product version*/
	} INQUIRY_DATA, *P_INQUIRY_DATA;			/* 24h*/

/* Request Sense command back data*/
	typedef struct _SENSE_DATA {
		uint8_t	ErrorCode;						/* 00h, error code and effective position*/
		uint8_t	SegmentNumber;
		uint8_t	SenseKeyAndEtc;					/* 02h, main key code*/
		uint8_t	Information0;
		uint8_t	Information1;
		uint8_t	Information2;
		uint8_t	Information3;
		uint8_t	AdditSenseLen;					/* 07h, the length of the follow -up data*/
		uint8_t	CmdSpecInfo[4];
		uint8_t	AdditSenseCode;					/* 0CH, additional key code*/
		uint8_t	AddSenCodeQual;					/* 0dh, detailed additional key code*/
		uint8_t	FieldReplaUnit;
		uint8_t	SenseKeySpec[3];
	} SENSE_DATA, *P_SENSE_DATA;				/* 12H*/

#endif

/* **********************************************************************************************************************/
/* Data input and output structure in the host file mode*/

#define MAX_FILE_NAME_LEN	//By LYN (defined in usbStructs.h)
#ifndef	MAX_FILE_NAME_LEN

#define MAX_FILE_NAME_LEN		(13+1)			/* The maximum length of the file name, the maximum length is 1 root directory symbol+8 main file name+1 decimal point+3 type name+ending character = 14*/

/* Input data and output data of the command*/
	typedef union _CH376_CMD_DATA {
		struct {
			uint8_t	mBuffer[MAX_FILE_NAME_LEN];
		} Default;

